Операторы прерывания break, continue, else.
Операторы прерывания цикла break
Сигнальная метка используется для того чтобы позволить, циклу работать более производительно
Оператор прерывания цикла break удобен в связке с сигнальными метками, когда после проверки некоторого условия нам нет смысла продолжать выполнения цикла сигнальная метка флажок может использоваться, когда надо чтобы одна часть программы узнала о происходящем в другой части программы. 
В предыдущих уроках мы говорили о цикле, который не имеет возможности завершиться и назвали его бесконечным циклом. Самый простой способ создать бесконечный цикл в Python – записать следующий код:
while True:
    print('Python awesome!')
Бесконечный цикл продолжает повторяться до тех пор, пока программа не будет прервана. Изучив оператор break, мы получили механизм прерывания бесконечных циклов.
Может показаться, что бесконечные циклы лишены смысла, однако это не совсем так. Например, вы можете написать программу, которая запускается и работает, постоянно принимая запросы на обслуживание.
Оператор continue
Другая стандартная идиома циклов это пропуск отдельных элементов при переборе. Оператор continue позволяет перейти к следующей итерации циклов for или while.

Ревью кода
Ревью кода – проверка исходного кода программы с целью обнаружения и исправления ошибок и неточностей, которые остались незамеченными при начальной разработке. 
В процессе ревью кода могут быть исправлены:
фактические ошибки;
производительность кода;
читабельность кода и ошибки форматирования кода.
Целью ревью кода является улучшение качества программного кода и совершенствование навыков программиста.
Как правило ревью кода выполняет программист с большим опытом.
Производительность кода
Под производительностью кода в простейшем случае можно подразумевать то, сколько времени программа тратит на решение задачи.
Отступы и пробелы
Названия переменных
Пустые строки
